sdas.org
#+TITLE: Smile Destructor Attack Script
#+DESCRIPTION: SDAS documentations
#+AUTHOR: Clement Chambard
#+EXPORT_FILE_NAME: ~/dev/SmileDestructor/SDAS/sdas_doc.html
#+SETUPFILE: https://fniessen.github.io/org-html-themes/org/theme-readtheorg.setup
#+OPTIONS: num:nil

* Syntax
** Header
Each script must begin with a specific header
#+begin_src sdas
    // Header
    attack_name: "name";
    anim_name: "anim name";
#+end_src
*** attack name
The name of the attack
    (used to get the script from a compiled fileblock)
*** anim name
The name of the animation
    (used to play anim along with the script)
** Begin and end of script
Each script must contain these statements :
#+begin_src  sdas
    // Header

    // Start close
    #begin

        // Script core

    // End close
    #end
#+end_src
- =#begin=
    will mark the entry point of the script and open a *code block*
- =#end=
    will mark the end of the *code block*. Anything after can only be *subroutines*
- =#sub= /name/
    will open a new code block for a new *sub*
** Subroutines
A script can use *subroutines* :
#+begin_src sdas
    // Header

    // Script that uses the subroutine
    #begin
        Subroutine();
    #end

    // Start a new subroutine and name it
    #sub Subroutine

        // Subroutine code

    // End close
    #end

#+end_src
** Comments
A comment is a line beginning with =//= or anything between the =/**/= delimiters as seen in the previous examples
** Frame labels
Each line of the script will be executed at a specific point in time
*** The 0 label
This time label will be executed when the script is first called
*** Relative labels
These labels compare the time with the previous label
#+begin_src sdas
    #begin

    0:  //the 0 label

    2:  // another label

    -1: // has time 2-1 = 1

    +2: // has time 1+2 = 3

    #end
#+end_src
** Position labels and jump instructions
*** Position label
These labels mark a position in the script.
#+begin_src sdas
    0:
        instruction1();
    label:
        instruction2();
#+end_src
*** Jump instructions
You can use any of the *jump instructions* to go directly to a label :
#+begin_src sdas
    label:
        instruction2();
        jump(label, 0);  // in that case, instruction2 will be executed indefinitely
#+end_src
- jump(pos, time);                    /-- see instruction 200/
- jumpDec(pos, time, var);            /-- see instruciton 201/
- jumpEq(pos, time, var1, var2);      /-- see instruciton 202/203/
- jumpNe(pos, time, var1, var2);      /-- see instruciton 204/205/
- jumpGt(pos, time, var1, var2);      /-- see instruciton 206/207/
- jumpGe(pos, time, var1, var2);      /-- see instruciton 208/209/
- jumpLt(pos, time, var1, var2);      /-- see instruciton 210/211/
- jumpLe(pos, time, var1, var2);      /-- see instruciton 212/213/
- jumpSt(pos, time);                  -- /see instruction 214/
- jumpNotSt(pos, time);               -- /see instruction 215/

* Aliases
Aliases are defined in the header with the keyword =using= and the syntax _alias = aliased_
** instruction alias
Combine the keyword =using= with =ins= or =instruction= to create an alias for an instruction.
You can define any number of aliases for a given instruction but it can't go in conflict with other names.
** variable alias
Combine the keyword =using= with =var= or =variable= to create an alias for a variable.
You can define any number of aliases for a given variable but it can't go in conflict with other names.
** value alias
Combine the keyword =using= with =val= or =value= to create an alias for a value.
You can define any number of aliases for a given value but it can't go in conflict with other names.
** example
#+begin_src sdas

using instruction aliasedIns = Instruction // instruction alias
using variable aliasedVar = Variable // variable alias
using value zero = 0 // value alias

#+end_src

* Registers and reserved values
** int values
- [ 100000 ] : I0        - rw        -- general purpose integer register
- [ 100001 ] : I1        - rw        -- general purpose integer register
- [ 100002 ] : I2        - rw        -- general purpose integer register
- [ 100003 ] : I3        - rw        -- general purpose integer register
- [ 100004 ] : I4        - rw        -- general purpose integer register
- [ 100005 ] : I5        - rw        -- general purpose integer register
- [ 100006 ] : I6        - rw        -- general purpose integer register
- [ 100007 ] : I7        - rw        -- general purpose integer register
- [ 100008 ] : I8        - rw        -- general purpose integer register
- [ 100009 ] : I9        - rw        -- general purpose integer register
- [ 100050 ] : Itop      - rw        -- used to store the result on top of the stack
