sdas_doc.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-03-26 Sat 16:33 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Smile Destructor Attack Script</title>
<meta name="author" content="Clement Chambard" />
<meta name="description" content="SDAS documentations" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Smile Destructor Attack Script</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orga2a4973">SYNTAX</a>
<ul>
<li><a href="#org5c9d609">Header</a>
<ul>
<li><a href="#orga244ba4">attack name</a></li>
<li><a href="#org1953923">anim name</a></li>
</ul>
</li>
<li><a href="#orge43c832">Begin and end of script</a></li>
<li><a href="#org0a2c425">Subroutines</a></li>
<li><a href="#orgdbf9d02">Comments</a></li>
<li><a href="#orge355c54">Frame labels</a>
<ul>
<li><a href="#orgf6fea73">The 0 label</a></li>
<li><a href="#orga586ca3">Relative labels</a></li>
</ul>
</li>
<li><a href="#orga40bf22">Position labels and jump instructions</a>
<ul>
<li><a href="#org74fedd1">Position label</a></li>
<li><a href="#org876ff9e">Jump instructions</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org520400b">ALIASES</a>
<ul>
<li><a href="#org5175872">instruction alias</a></li>
<li><a href="#org60edf99">variable alias</a></li>
<li><a href="#orgc877fee">value alias</a></li>
<li><a href="#org54ed367">example</a></li>
</ul>
</li>
<li><a href="#org94ebb64">REGISTERS AND RESERVED VALUES</a>
<ul>
<li><a href="#orgd78f332">int values</a></li>
<li><a href="#org0174c4f">float values</a></li>
</ul>
</li>
<li><a href="#org801ad38">INSTRUCTION SET:</a></li>
</ul>
</div>
</div>

<div id="outline-container-orga2a4973" class="outline-2">
<h2 id="orga2a4973">SYNTAX</h2>
<div class="outline-text-2" id="text-orga2a4973">
</div>
<div id="outline-container-org5c9d609" class="outline-3">
<h3 id="org5c9d609">Header</h3>
<div class="outline-text-3" id="text-org5c9d609">
<p>
Each script must begin with a specific header
</p>
<div class="org-src-container">
<pre class="src src-sdas

">
    // Header
    attack_name: "name";
    anim_name: "anim name";
</pre>
</div>
</div>
<div id="outline-container-orga244ba4" class="outline-4">
<h4 id="orga244ba4">attack name</h4>
<div class="outline-text-4" id="text-orga244ba4">
<p>
The name of the attack
    (used in interpreter mode)
</p>
</div>
</div>
<div id="outline-container-org1953923" class="outline-4">
<h4 id="org1953923">anim name</h4>
<div class="outline-text-4" id="text-org1953923">
<p>
The name of the animation
    (used to play anim along with the script)
</p>
</div>
</div>
</div>
<div id="outline-container-orge43c832" class="outline-3">
<h3 id="orge43c832">Begin and end of script</h3>
<div class="outline-text-3" id="text-orge43c832">
<p>
Each script must contain these statements :
</p>
<div class="org-src-container">
<pre class="src src-sdas

">
    // Header

    // Start close
    #begin

        // Script core

    // End close
    #end
</pre>
</div>
<ul class="org-ul">
<li><code>#begin</code>
will mark the entry point of the script and open a <b>code block</b></li>
<li><code>#end</code>
will mark the end of the <b>code block</b>. Anything after can only be <b>subroutines</b></li>
<li><code>#sub</code> <i>name</i>
will open a new code block for a new <b>sub</b></li>
</ul>
</div>
</div>
<div id="outline-container-org0a2c425" class="outline-3">
<h3 id="org0a2c425">Subroutines</h3>
<div class="outline-text-3" id="text-org0a2c425">
<p>
A script can use <b>subroutines</b> :
</p>
<div class="org-src-container">
<pre class="src src-sdas

">
    // Header

    // Script that uses the subroutine
    #begin
        Subroutine();
    #end

    // Start a new subroutine and name it
    #sub Subroutine

        // Subroutine code

    // End close
    #end

</pre>
</div>
</div>
</div>
<div id="outline-container-orgdbf9d02" class="outline-3">
<h3 id="orgdbf9d02">Comments</h3>
<div class="outline-text-3" id="text-orgdbf9d02">
<p>
A comment is a line beginning with <code>//</code> or anything between the <code>/**/</code> delimiters as seen in the previous examples
</p>
</div>
</div>
<div id="outline-container-orge355c54" class="outline-3">
<h3 id="orge355c54">Frame labels</h3>
<div class="outline-text-3" id="text-orge355c54">
<p>
Each line of the script will be executed at a specific point in time
</p>
</div>
<div id="outline-container-orgf6fea73" class="outline-4">
<h4 id="orgf6fea73">The 0 label</h4>
<div class="outline-text-4" id="text-orgf6fea73">
<p>
This time label will be executed when the script is first called
</p>
</div>
</div>
<div id="outline-container-orga586ca3" class="outline-4">
<h4 id="orga586ca3">Relative labels</h4>
<div class="outline-text-4" id="text-orga586ca3">
<p>
These labels compare the time with the previous label
</p>
<div class="org-src-container">
<pre class="src src-sdas

">
    #begin

    0:  //the 0 label

    2:  // another label

    -1: // has time 2-1 = 1

    +2: // has time 1+2 = 3

    #end
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orga40bf22" class="outline-3">
<h3 id="orga40bf22">Position labels and jump instructions</h3>
<div class="outline-text-3" id="text-orga40bf22">
</div>
<div id="outline-container-org74fedd1" class="outline-4">
<h4 id="org74fedd1">Position label</h4>
<div class="outline-text-4" id="text-org74fedd1">
<p>
These labels mark a position in the script.
</p>
<div class="org-src-container">
<pre class="src src-sdas

">
    0:
        instruction1();
    label:
        instruction2();
</pre>
</div>
</div>
</div>
<div id="outline-container-org876ff9e" class="outline-4">
<h4 id="org876ff9e">Jump instructions</h4>
<div class="outline-text-4" id="text-org876ff9e">
<p>
You can use any of the <b>jump instructions</b> to go directly to a label :
</p>
<div class="org-src-container">
<pre class="src src-sdas

">
    label:
        instruction2();
        jump(label, 0);  // in that case, instruction2 will be executed indefinitely
</pre>
</div>
<ul class="org-ul">
<li>jump(pos, time);                    <i>&#x2013; see instruction 200</i></li>
<li>jumpDec(pos, time, var);            <i>&#x2013; see instruciton 201</i></li>
<li>jumpEq(pos, time, var1, var2);      <i>&#x2013; see instruciton 202/203</i></li>
<li>jumpNe(pos, time, var1, var2);      <i>&#x2013; see instruciton 204/205</i></li>
<li>jumpGt(pos, time, var1, var2);      <i>&#x2013; see instruciton 206/207</i></li>
<li>jumpGe(pos, time, var1, var2);      <i>&#x2013; see instruciton 208/209</i></li>
<li>jumpLt(pos, time, var1, var2);      <i>&#x2013; see instruciton 210/211</i></li>
<li>jumpLe(pos, time, var1, var2);      <i>&#x2013; see instruciton 212/213</i></li>
<li>jumpSt(pos, time);                  &#x2013; <i>see instruction 214</i></li>
<li>jumpNotSt(pos, time);               &#x2013; <i>see instruction 215</i></li>
</ul>
</div>
</div>
</div>
</div>

<div id="outline-container-org520400b" class="outline-2">
<h2 id="org520400b">ALIASES</h2>
<div class="outline-text-2" id="text-org520400b">
<p>
Aliases are defined in the header with the keyword <code>using</code> and the syntax <span class="underline">alias = aliased</span>
</p>
</div>
<div id="outline-container-org5175872" class="outline-3">
<h3 id="org5175872">instruction alias</h3>
<div class="outline-text-3" id="text-org5175872">
<p>
Combine the keyword <code>using</code> with <code>ins</code> or <code>instruction</code> to create an alias for an instruction.
You can define any number of aliases for a given instruction but it can&rsquo;t go in conflict with other names.
</p>
</div>
</div>
<div id="outline-container-org60edf99" class="outline-3">
<h3 id="org60edf99">variable alias</h3>
<div class="outline-text-3" id="text-org60edf99">
<p>
Combine the keyword <code>using</code> with <code>var</code> or <code>variable</code> to create an alias for a variable.
You can define any number of aliases for a given variable but it can&rsquo;t go in conflict with other names.
</p>
</div>
</div>
<div id="outline-container-orgc877fee" class="outline-3">
<h3 id="orgc877fee">value alias</h3>
<div class="outline-text-3" id="text-orgc877fee">
<p>
Combine the keyword <code>using</code> with <code>val</code> or <code>value</code> to create an alias for a value.
You can define any number of aliases for a given value but it can&rsquo;t go in conflict with other names.
</p>
</div>
</div>
<div id="outline-container-org54ed367" class="outline-3">
<h3 id="org54ed367">example</h3>
<div class="outline-text-3" id="text-org54ed367">
<div class="org-src-container">
<pre class="src src-sdas

using

using">
using

using instruction aliasedIns = Instruction // instruction alias
using variable aliasedVar = Variable // variable alias
using value zero = 0 // value alias

</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org94ebb64" class="outline-2">
<h2 id="org94ebb64">REGISTERS AND RESERVED VALUES</h2>
<div class="outline-text-2" id="text-org94ebb64">
</div>
<div id="outline-container-orgd78f332" class="outline-3">
<h3 id="orgd78f332">int values</h3>
<div class="outline-text-3" id="text-orgd78f332">
<ul class="org-ul">
<li>[ 100000 ] : I0        - rw        &#x2013; general purpose integer register</li>
<li>[ 100001 ] : I1        - rw        &#x2013; general purpose integer register</li>
<li>[ 100002 ] : I2        - rw        &#x2013; general purpose integer register</li>
<li>[ 100003 ] : I3        - rw        &#x2013; general purpose integer register</li>
<li>[ 100004 ] : I4        - rw        &#x2013; general purpose integer register</li>
<li>[ 100005 ] : I5        - rw        &#x2013; general purpose integer register</li>
<li>[ 100006 ] : I6        - rw        &#x2013; general purpose integer register</li>
<li>[ 100007 ] : I7        - rw        &#x2013; general purpose integer register</li>
<li>[ 100008 ] : I8        - rw        &#x2013; general purpose integer register</li>
<li>[ 100009 ] : I9        - rw        &#x2013; general purpose integer register</li>
<li>[ 100050 ] : Itop      - rw        &#x2013; used to store the result on top of the stack</li>
</ul>
</div>
</div>
