sdas.org
** float values
- [100010.f] : f0        - rw        -- general purpose float register
- [100011.f] : f1        - rw        -- general purpose float register
- [100012.f] : f2        - rw        -- general purpose float register
- [100013.f] : f3        - rw        -- general purpose float register
- [100014.f] : f4        - rw        -- general purpose float register
- [100015.f] : f5        - rw        -- general purpose float register
- [100016.f] : f6        - rw        -- general purpose float register
- [100017.f] : f7        - rw        -- general purpose float register
- [100018.f] : f8        - rw        -- general purpose float register
- [100019.f] : f9        - rw        -- general purpose float register
- [100051.f] : ftop      - rw        -- used to store the result on top of the stack

