sdas_doc.html
<div id="outline-container-org0174c4f" class="outline-3">
<h3 id="org0174c4f">float values</h3>
<div class="outline-text-3" id="text-org0174c4f">
<ul class="org-ul">
<li>[100010.f] : f0        - rw        &#x2013; general purpose float register</li>
<li>[100011.f] : f1        - rw        &#x2013; general purpose float register</li>
<li>[100012.f] : f2        - rw        &#x2013; general purpose float register</li>
<li>[100013.f] : f3        - rw        &#x2013; general purpose float register</li>
<li>[100014.f] : f4        - rw        &#x2013; general purpose float register</li>
<li>[100015.f] : f5        - rw        &#x2013; general purpose float register</li>
<li>[100016.f] : f6        - rw        &#x2013; general purpose float register</li>
<li>[100017.f] : f7        - rw        &#x2013; general purpose float register</li>
<li>[100018.f] : f8        - rw        &#x2013; general purpose float register</li>
<li>[100019.f] : f9        - rw        &#x2013; general purpose float register</li>
<li>[100051.f] : ftop      - rw        &#x2013; used to store the result on top of the stack</li>
</ul>
</div>
</div>
</div>
