sdas_doc.html

<div id="outline-container-org801ad38" class="outline-2">
<h2 id="org801ad38">INSTRUCTION SET:</h2>
<div class="outline-text-2" id="text-org801ad38">
<ul class="org-ul">
<li>script flow instructions (0-99)</li>
<li>math instructions (100-199)</li>
<li>jump and loop instructions (200-299)</li>
<li>hitbox and hurtbox instructions (300-399)</li>
<li>motion related instructions (400-499)</li>
</ul>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">asm</th>
<th scope="col" class="org-left">ins</th>
<th scope="col" class="org-left">name</th>
<th scope="col" class="org-left">arguments</th>
<th scope="col" class="org-left">description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">0x0000</td>
<td class="org-left">ins<sub>0</sub></td>
<td class="org-left">nop</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">does nothing</td>
</tr>

<tr>
<td class="org-right">0x0001</td>
<td class="org-left">ins<sub>1</sub></td>
<td class="org-left">ret</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">returns from the current subroutine</td>
</tr>

<tr>
<td class="org-right">0x0002</td>
<td class="org-left">ins<sub>2</sub></td>
<td class="org-left">call</td>
<td class="org-left">int</td>
<td class="org-left">calls a subroutine at <i>arg0</i></td>
</tr>

<tr>
<td class="org-right">0x0032</td>
<td class="org-left">ins<sub>50</sub></td>
<td class="org-left">puts</td>
<td class="org-left">int</td>
<td class="org-left">print string at offset <i>arg0</i></td>
</tr>

<tr>
<td class="org-right">0x0033</td>
<td class="org-left">ins<sub>51</sub></td>
<td class="org-left">putc</td>
<td class="org-left">int</td>
<td class="org-left">print integer <i>arg0</i> as character</td>
</tr>

<tr>
<td class="org-right">0x0034</td>
<td class="org-left">ins<sub>52</sub></td>
<td class="org-left">puti</td>
<td class="org-left">int</td>
<td class="org-left">print integer <i>arg0</i></td>
</tr>

<tr>
<td class="org-right">0x0035</td>
<td class="org-left">ins<sub>53</sub></td>
<td class="org-left">putf</td>
<td class="org-left">float</td>
<td class="org-left">print float <i>arg0</i></td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-right">0x0064</td>
<td class="org-left">ins<sub>100</sub></td>
<td class="org-left">iset</td>
<td class="org-left">&amp;int   int</td>
<td class="org-left"><i>arg0</i> = <i>arg1</i></td>
</tr>

<tr>
<td class="org-right">0x0065</td>
<td class="org-left">ins<sub>101</sub></td>
<td class="org-left">fset</td>
<td class="org-left">&amp;float float</td>
<td class="org-left"><i>arg0</i> = <i>arg1</i></td>
</tr>

<tr>
<td class="org-right">0x0066</td>
<td class="org-left">ins<sub>102</sub></td>
<td class="org-left">ipsh</td>
<td class="org-left">int</td>
<td class="org-left">push <i>arg0</i></td>
</tr>

<tr>
<td class="org-right">0x0067</td>
<td class="org-left">ins<sub>103</sub></td>
<td class="org-left">fpsh</td>
<td class="org-left">float</td>
<td class="org-left">push <i>arg0</i></td>
</tr>

<tr>
<td class="org-right">0x0068</td>
<td class="org-left">ins<sub>104</sub></td>
<td class="org-left">ipop</td>
<td class="org-left">&amp;int</td>
<td class="org-left">pop <i>arg0</i></td>
</tr>

<tr>
<td class="org-right">0x0069</td>
<td class="org-left">ins<sub>105</sub></td>
<td class="org-left">fpop</td>
<td class="org-left">&amp;float</td>
<td class="org-left">pop <i>arg0</i></td>
</tr>

<tr>
<td class="org-right">0x006A</td>
<td class="org-left">ins<sub>106</sub></td>
<td class="org-left">iadd</td>
<td class="org-left">&amp;int   int</td>
<td class="org-left"><i>arg0</i> += <i>arg1</i></td>
</tr>

<tr>
<td class="org-right">0x006B</td>
<td class="org-left">ins<sub>107</sub></td>
<td class="org-left">fadd</td>
<td class="org-left">&amp;float float</td>
<td class="org-left"><i>arg0</i> += <i>arg1</i></td>
</tr>

<tr>
<td class="org-right">0x006A</td>
<td class="org-left">ins<sub>108</sub></td>
<td class="org-left">isub</td>
<td class="org-left">&amp;int   int</td>
<td class="org-left"><i>arg0</i> -= <i>arg1</i></td>
</tr>

<tr>
<td class="org-right">0x006B</td>
<td class="org-left">ins<sub>109</sub></td>
<td class="org-left">fsub</td>
<td class="org-left">&amp;float float</td>
<td class="org-left"><i>arg0</i> -= <i>arg1</i></td>
</tr>

<tr>
<td class="org-right">0x006C</td>
<td class="org-left">ins<sub>110</sub></td>
<td class="org-left">imul</td>
<td class="org-left">&amp;int   int</td>
<td class="org-left"><i>arg0</i> *= <i>arg1</i></td>
</tr>

<tr>
<td class="org-right">0x006D</td>
<td class="org-left">ins<sub>111</sub></td>
<td class="org-left">fmul</td>
<td class="org-left">&amp;float float</td>
<td class="org-left"><i>arg0</i> *= <i>arg1</i></td>
</tr>

<tr>
<td class="org-right">0x006E</td>
<td class="org-left">ins<sub>112</sub></td>
<td class="org-left">idiv</td>
<td class="org-left">&amp;int   int</td>
<td class="org-left"><i>arg0</i> <i>= /arg1</i></td>
</tr>

<tr>
<td class="org-right">0x006F</td>
<td class="org-left">ins<sub>113</sub></td>
<td class="org-left">fdiv</td>
<td class="org-left">&amp;float float</td>
<td class="org-left"><i>arg0</i> <i>= /arg1</i></td>
</tr>

<tr>
<td class="org-right">0x0070</td>
<td class="org-left">ins<sub>114</sub></td>
<td class="org-left">imod</td>
<td class="org-left">&amp;int   int</td>
<td class="org-left"><i>arg0</i> %= <i>arg1</i></td>
</tr>

<tr>
<td class="org-right">0x0071</td>
<td class="org-left">ins<sub>115</sub></td>
<td class="org-left">fmod</td>
<td class="org-left">&amp;float float</td>
<td class="org-left"><i>arg0</i> %= <i>arg1</i></td>
</tr>

<tr>
<td class="org-right">0x0072</td>
<td class="org-left">ins<sub>116</sub></td>
<td class="org-left">isadd</td>
<td class="org-left">&amp;int   int   int</td>
<td class="org-left"><i>arg0</i> = <i>arg1</i> + <i>arg2</i></td>
</tr>

<tr>
<td class="org-right">0x0073</td>
<td class="org-left">ins<sub>117</sub></td>
<td class="org-left">fsadd</td>
<td class="org-left">&amp;float float float</td>
<td class="org-left"><i>arg0</i> = <i>arg1</i> + <i>arg2</i></td>
</tr>

<tr>
<td class="org-right">0x0074</td>
<td class="org-left">ins<sub>118</sub></td>
<td class="org-left">issub</td>
<td class="org-left">&amp;int   int   int</td>
<td class="org-left"><i>arg0</i> = <i>arg1</i> - <i>arg2</i></td>
</tr>

<tr>
<td class="org-right">0x0075</td>
<td class="org-left">ins<sub>119</sub></td>
<td class="org-left">fssub</td>
<td class="org-left">&amp;float float float</td>
<td class="org-left"><i>arg0</i> = <i>arg1</i> - <i>arg2</i></td>
</tr>

<tr>
<td class="org-right">0x0076</td>
<td class="org-left">ins<sub>120</sub></td>
<td class="org-left">ismul</td>
<td class="org-left">&amp;int   int   int</td>
<td class="org-left"><i>arg0</i> = <i>arg1</i> * <i>arg2</i></td>
</tr>

<tr>
<td class="org-right">0x0077</td>
<td class="org-left">ins<sub>121</sub></td>
<td class="org-left">fsmul</td>
<td class="org-left">&amp;float float float</td>
<td class="org-left"><i>arg0</i> = <i>arg1</i> * <i>arg2</i></td>
</tr>

<tr>
<td class="org-right">0x0078</td>
<td class="org-left">ins<sub>122</sub></td>
<td class="org-left">isdiv</td>
<td class="org-left">&amp;int   int   int</td>
<td class="org-left"><i>arg0</i> = <i>arg1</i> / <i>arg2</i></td>
</tr>

<tr>
<td class="org-right">0x0079</td>
<td class="org-left">ins<sub>123</sub></td>
<td class="org-left">fsdiv</td>
<td class="org-left">&amp;float float float</td>
<td class="org-left"><i>arg0</i> = <i>arg1</i> / <i>arg2</i></td>
</tr>

<tr>
<td class="org-right">0x007A</td>
<td class="org-left">ins<sub>124</sub></td>
<td class="org-left">ismod</td>
<td class="org-left">&amp;int   int   int</td>
<td class="org-left"><i>arg0</i> = <i>arg1</i> % <i>arg2</i></td>
</tr>

<tr>
<td class="org-right">0x007B</td>
<td class="org-left">ins<sub>125</sub></td>
<td class="org-left">fsmod</td>
<td class="org-left">&amp;float float float</td>
<td class="org-left"><i>arg0</i> = <i>arg1</i> % <i>arg2</i></td>
</tr>

<tr>
<td class="org-right">0x007C</td>
<td class="org-left">ins<sub>126</sub></td>
<td class="org-left">ieq</td>
<td class="org-left">&amp;bool  int   int</td>
<td class="org-left"><i>arg0</i> = <i>arg1</i> == <i>arg2</i></td>
</tr>

<tr>
<td class="org-right">0x007D</td>
<td class="org-left">ins<sub>127</sub></td>
<td class="org-left">feq</td>
<td class="org-left">&amp;bool  float  float</td>
<td class="org-left"><i>arg0</i> = <i>arg1</i> == <i>arg2</i></td>
</tr>

<tr>
<td class="org-right">0x007E</td>
<td class="org-left">ins<sub>128</sub></td>
<td class="org-left">ineq</td>
<td class="org-left">&amp;bool  int    int</td>
<td class="org-left"><i>arg0</i> = <i>arg1</i> != <i>arg2</i></td>
</tr>

<tr>
<td class="org-right">0x007F</td>
<td class="org-left">ins<sub>129</sub></td>
<td class="org-left">fneq</td>
<td class="org-left">&amp;bool  float  float</td>
<td class="org-left"><i>arg0</i> = <i>arg1</i> != <i>arg2</i></td>
</tr>

<tr>
<td class="org-right">0x0080</td>
<td class="org-left">ins<sub>130</sub></td>
<td class="org-left">igt</td>
<td class="org-left">&amp;bool  int    int</td>
<td class="org-left"><i>arg0</i> = <i>arg1</i> &gt;  <i>arg2</i></td>
</tr>

<tr>
<td class="org-right">0x0081</td>
<td class="org-left">ins<sub>131</sub></td>
<td class="org-left">fgt</td>
<td class="org-left">&amp;bool  float  float</td>
<td class="org-left"><i>arg0</i> = <i>arg1</i> &gt;  <i>arg2</i></td>
</tr>

<tr>
<td class="org-right">0x0082</td>
<td class="org-left">ins<sub>132</sub></td>
<td class="org-left">ige</td>
<td class="org-left">&amp;bool  int    int</td>
<td class="org-left"><i>arg0</i> = <i>arg1</i> &gt;= <i>arg2</i></td>
</tr>

<tr>
<td class="org-right">0x0083</td>
<td class="org-left">ins<sub>133</sub></td>
<td class="org-left">fge</td>
<td class="org-left">&amp;bool  float  float</td>
<td class="org-left"><i>arg0</i> = <i>arg1</i> &gt;= <i>arg2</i></td>
</tr>

<tr>
<td class="org-right">0x0084</td>
<td class="org-left">ins<sub>134</sub></td>
<td class="org-left">ilt</td>
<td class="org-left">&amp;bool  int    int</td>
<td class="org-left"><i>arg0</i> = <i>arg1</i> &lt;  <i>arg2</i></td>
</tr>

<tr>
<td class="org-right">0x0085</td>
<td class="org-left">ins<sub>135</sub></td>
<td class="org-left">flt</td>
<td class="org-left">&amp;bool  float  float</td>
<td class="org-left"><i>arg0</i> = <i>arg1</i> &lt;  <i>arg2</i></td>
</tr>

<tr>
<td class="org-right">0x0086</td>
<td class="org-left">ins<sub>136</sub></td>
<td class="org-left">ile</td>
<td class="org-left">&amp;bool  int    int</td>
<td class="org-left"><i>arg0</i> = <i>arg1</i> &lt;= <i>arg2</i></td>
</tr>

<tr>
<td class="org-right">0x0087</td>
<td class="org-left">ins<sub>137</sub></td>
<td class="org-left">fle</td>
<td class="org-left">&amp;bool  float  float</td>
<td class="org-left"><i>arg0</i> = <i>arg1</i> &lt;= <i>arg2</i></td>
</tr>

<tr>
<td class="org-right">0x0088</td>
<td class="org-left">ins<sub>138</sub></td>
<td class="org-left">not</td>
<td class="org-left">&amp;bool  bool</td>
<td class="org-left"><i>arg0</i> = <b>not</b> <i>arg1</i></td>
</tr>

<tr>
<td class="org-right">0x0089</td>
<td class="org-left">ins<sub>139</sub></td>
<td class="org-left">and</td>
<td class="org-left">&amp;bool  bool   bool</td>
<td class="org-left"><i>arg0</i> = <i>arg1</i> <b>and</b> <i>arg2</i></td>
</tr>

<tr>
<td class="org-right">0x008A</td>
<td class="org-left">ins<sub>140</sub></td>
<td class="org-left">or</td>
<td class="org-left">&amp;bool  bool   bool</td>
<td class="org-left"><i>arg0</i> = <i>arg1</i> <b>or</b> <i>arg2</i></td>
</tr>

<tr>
<td class="org-right">0x008B</td>
<td class="org-left">ins<sub>141</sub></td>
<td class="org-left">xor</td>
<td class="org-left">&amp;bool  bool   bool</td>
<td class="org-left"><i>arg0</i> = <i>arg1</i> <b>xor</b> <i>arg2</i></td>
</tr>

<tr>
<td class="org-right">0x008C</td>
<td class="org-left">ins<sub>142</sub></td>
<td class="org-left">istadd</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">+ the top of the stack</td>
</tr>

<tr>
<td class="org-right">0x008D</td>
<td class="org-left">ins<sub>143</sub></td>
<td class="org-left">fstadd</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">+ the top of the stack</td>
</tr>

<tr>
<td class="org-right">0x008E</td>
<td class="org-left">ins<sub>144</sub></td>
<td class="org-left">istsub</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">- the top of the stack</td>
</tr>

<tr>
<td class="org-right">0x008F</td>
<td class="org-left">ins<sub>145</sub></td>
<td class="org-left">fstsub</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">- the top of the stack</td>
</tr>

<tr>
<td class="org-right">0x0090</td>
<td class="org-left">ins<sub>146</sub></td>
<td class="org-left">istmul</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">* the top of the stack</td>
</tr>

<tr>
<td class="org-right">0x0091</td>
<td class="org-left">ins<sub>147</sub></td>
<td class="org-left">fstmul</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">* the top of the stack</td>
</tr>

<tr>
<td class="org-right">0x0092</td>
<td class="org-left">ins<sub>148</sub></td>
<td class="org-left">istdiv</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">/ the top of the stack</td>
</tr>

<tr>
<td class="org-right">0x0093</td>
<td class="org-left">ins<sub>149</sub></td>
<td class="org-left">fstdiv</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">/ the top of the stack</td>
</tr>

<tr>
<td class="org-right">0x0094</td>
<td class="org-left">ins<sub>150</sub></td>
<td class="org-left">istmod</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">% the top of the stack</td>
</tr>

<tr>
<td class="org-right">0x0095</td>
<td class="org-left">ins<sub>151</sub></td>
<td class="org-left">fstmod</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">% the top of the stack</td>
</tr>

<tr>
<td class="org-right">0x0096</td>
<td class="org-left">ins<sub>152</sub></td>
<td class="org-left">isteq</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">eq the top of the stack</td>
</tr>

<tr>
<td class="org-right">0x0097</td>
<td class="org-left">ins<sub>153</sub></td>
<td class="org-left">fsteq</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">eq the top of the stack</td>
</tr>

<tr>
<td class="org-right">0x0098</td>
<td class="org-left">ins<sub>154</sub></td>
<td class="org-left">istneq</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">!= the top of the stack</td>
</tr>

<tr>
<td class="org-right">0x0099</td>
<td class="org-left">ins<sub>155</sub></td>
<td class="org-left">fstneq</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">!= the top of the stack</td>
</tr>

<tr>
<td class="org-right">0x009A</td>
<td class="org-left">ins<sub>156</sub></td>
<td class="org-left">istgt</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&gt;  the top of the stack</td>
</tr>

<tr>
<td class="org-right">0x009B</td>
<td class="org-left">ins<sub>157</sub></td>
<td class="org-left">fstgt</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&gt;  the top of the stack</td>
</tr>

<tr>
<td class="org-right">0x009C</td>
<td class="org-left">ins<sub>158</sub></td>
<td class="org-left">istge</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&gt;= the top of the stack</td>
</tr>

<tr>
<td class="org-right">0x009D</td>
<td class="org-left">ins<sub>159</sub></td>
<td class="org-left">fstge</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&gt;= the top of the stack</td>
</tr>

<tr>
<td class="org-right">0x009E</td>
<td class="org-left">ins<sub>160</sub></td>
<td class="org-left">istlt</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&lt;  the top of the stack</td>
</tr>

<tr>
<td class="org-right">0x009F</td>
<td class="org-left">ins<sub>161</sub></td>
<td class="org-left">fstlt</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&lt;  the top of the stack</td>
</tr>

<tr>
<td class="org-right">0x00A0</td>
<td class="org-left">ins<sub>162</sub></td>
<td class="org-left">istle</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&lt;= the top of the stack</td>
</tr>

<tr>
<td class="org-right">0x00A1</td>
<td class="org-left">ins<sub>163</sub></td>
<td class="org-left">fstle</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&lt;= the top of the stack</td>
</tr>

<tr>
<td class="org-right">0x00A2</td>
<td class="org-left">ins<sub>164</sub></td>
<td class="org-left">stnot</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">!  the top of the stack</td>
</tr>

<tr>
<td class="org-right">0x00A3</td>
<td class="org-left">ins<sub>165</sub></td>
<td class="org-left">stand</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&amp;&amp; the top of the stack</td>
</tr>

<tr>
<td class="org-right">0x00A4</td>
<td class="org-left">ins<sub>166</sub></td>
<td class="org-left">stor</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">or the top of the stack</td>
</tr>

<tr>
<td class="org-right">0x00A5</td>
<td class="org-left">ins<sub>167</sub></td>
<td class="org-left">stxor</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">^  the top of the stack</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-right">0x00C8</td>
<td class="org-left">ins<sub>200</sub></td>
<td class="org-left">jmp</td>
<td class="org-left">int    int</td>
<td class="org-left">jump to <i>arg0</i> at time <i>arg1</i> if <i>arg2</i>&#x2013; &gt; 0</td>
</tr>

<tr>
<td class="org-right">0x00C9</td>
<td class="org-left">ins<sub>201</sub></td>
<td class="org-left">jmdec</td>
<td class="org-left">int    int   &amp;int</td>
<td class="org-left">jump to <i>arg0</i> at time <i>arg1</i></td>
</tr>

<tr>
<td class="org-right">0x00CA</td>
<td class="org-left">ins<sub>202</sub></td>
<td class="org-left">jmieq</td>
<td class="org-left">int    int   int   int</td>
<td class="org-left">jump to <i>arg0</i> at time <i>arg1</i> if <i>arg2</i> == <i>arg3</i></td>
</tr>

<tr>
<td class="org-right">0x00CB</td>
<td class="org-left">ins<sub>203</sub></td>
<td class="org-left">jmfeq</td>
<td class="org-left">int    int   float float</td>
<td class="org-left">jump to <i>arg0</i> at time <i>arg1</i> if <i>arg2</i> == <i>arg3</i></td>
</tr>

<tr>
<td class="org-right">0x00CC</td>
<td class="org-left">ins<sub>204</sub></td>
<td class="org-left">jmine</td>
<td class="org-left">int    int   int   int</td>
<td class="org-left">jump to <i>arg0</i> at time <i>arg1</i> if <i>arg2</i> != <i>arg3</i></td>
</tr>

<tr>
<td class="org-right">0x00CD</td>
<td class="org-left">ins<sub>205</sub></td>
<td class="org-left">jmfne</td>
<td class="org-left">int    int   float float</td>
<td class="org-left">jump to <i>arg0</i> at time <i>arg1</i> if <i>arg2</i> != <i>arg3</i></td>
</tr>

<tr>
<td class="org-right">0x00CE</td>
<td class="org-left">ins<sub>206</sub></td>
<td class="org-left">jmigt</td>
<td class="org-left">int    int   int   int</td>
<td class="org-left">jump to <i>arg0</i> at time <i>arg1</i> if <i>arg2</i> &gt;  <i>arg3</i></td>
</tr>

<tr>
<td class="org-right">0x00CF</td>
<td class="org-left">ins<sub>207</sub></td>
<td class="org-left">jmfgt</td>
<td class="org-left">int    int   float float</td>
<td class="org-left">jump to <i>arg0</i> at time <i>arg1</i> if <i>arg2</i> &gt;  <i>arg3</i></td>
</tr>

<tr>
<td class="org-right">0x00D0</td>
<td class="org-left">ins<sub>208</sub></td>
<td class="org-left">jmige</td>
<td class="org-left">int    int   int   int</td>
<td class="org-left">jump to <i>arg0</i> at time <i>arg1</i> if <i>arg2</i> &gt;= <i>arg3</i></td>
</tr>

<tr>
<td class="org-right">0x00D1</td>
<td class="org-left">ins<sub>209</sub></td>
<td class="org-left">jmfge</td>
<td class="org-left">int    int   float float</td>
<td class="org-left">jump to <i>arg0</i> at time <i>arg1</i> if <i>arg2</i> &gt;= <i>arg3</i></td>
</tr>

<tr>
<td class="org-right">0x00D2</td>
<td class="org-left">ins<sub>210</sub></td>
<td class="org-left">jmilt</td>
<td class="org-left">int    int   int   int</td>
<td class="org-left">jump to <i>arg0</i> at time <i>arg1</i> if <i>arg2</i> &lt;  <i>arg3</i></td>
</tr>

<tr>
<td class="org-right">0x00D3</td>
<td class="org-left">ins<sub>211</sub></td>
<td class="org-left">jmflt</td>
<td class="org-left">int    int   float float</td>
<td class="org-left">jump to <i>arg0</i> at time <i>arg1</i> if <i>arg2</i> &lt;  <i>arg3</i></td>
</tr>

<tr>
<td class="org-right">0x00D4</td>
<td class="org-left">ins<sub>212</sub></td>
<td class="org-left">jmile</td>
<td class="org-left">int    int   int   int</td>
<td class="org-left">jump to <i>arg0</i> at time <i>arg1</i> if <i>arg2</i> &lt;= <i>arg3</i></td>
</tr>

<tr>
<td class="org-right">0x00D5</td>
<td class="org-left">ins<sub>213</sub></td>
<td class="org-left">jmfle</td>
<td class="org-left">int    int   float float</td>
<td class="org-left">jump to <i>arg0</i> at time <i>arg1</i> if <i>arg2</i> &lt;= <i>arg3</i></td>
</tr>

<tr>
<td class="org-right">0x00D6</td>
<td class="org-left">ins<sub>214</sub></td>
<td class="org-left">jmst</td>
<td class="org-left">int    int</td>
<td class="org-left">jump to <i>arg0</i> at time <i>arg1</i> if stTop != 0</td>
</tr>

<tr>
<td class="org-right">0x00D7</td>
<td class="org-left">ins<sub>215</sub></td>
<td class="org-left">jmnst</td>
<td class="org-left">int    int</td>
<td class="org-left">jump to <i>arg0</i> at time <i>arg1</i> if stTop == 0</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-right">0x012C</td>
<td class="org-left">ins<sub>300</sub></td>
<td class="org-left">attack</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#x2013; see the attack related part</td>
</tr>

<tr>
<td class="org-right">0x012D</td>
<td class="org-left">ins<sub>301</sub></td>
<td class="org-left">rstHit</td>
<td class="org-left">int</td>
<td class="org-left">reset hitbox group arg0</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Clement Chambard</p>
<p class="date">Created: 2022-03-26 Sat 16:33</p>
</div>
</body>
</html>
